{
  "format": "graph-model",
  "generatedBy": "torch.save",
  "convertedBy": "tfjs@4.22.0",
  "modelTopology": {
    "node": [
      {
        "name": "input",
        "op": "Placeholder",
        "attr": {
          "dtype": {
            "type": "DT_FLOAT"
          },
          "shape": {
            "shape": {
              "dim": [
                {
                  "size": -1
                },
                {
                  "size": -1
                },
                {
                  "size": -1
                },
                {
                  "size": 3
                }
              ]
            }
          }
        }
      },
      {
        "name": "conv_first/conv",
        "op": "Conv2D",
        "input": [
          "input"
        ],
        "attr": {
          "kernel_size": {
            "list": {
              "i": [
                3,
                3
              ]
            }
          },
          "filters": {
            "i": 64
          },
          "strides": {
            "list": {
              "i": [
                1,
                1
              ]
            }
          },
          "padding": {
            "s": "same"
          },
          "data_format": {
            "s": "NHWC"
          }
        }
      },
      {
        "name": "rrdb_0/rdb1/conv1/conv",
        "op": "Conv2D",
        "input": [
          "conv_first/conv"
        ],
        "attr": {
          "kernel_size": {
            "list": {
              "i": [
                3,
                3
              ]
            }
          },
          "filters": {
            "i": 32
          },
          "strides": {
            "list": {
              "i": [
                1,
                1
              ]
            }
          },
          "padding": {
            "s": "same"
          },
          "data_format": {
            "s": "NHWC"
          }
        }
      },
      {
        "name": "rrdb_0/rdb1/conv1/leaky_relu",
        "op": "LeakyRelu",
        "input": [
          "rrdb_0/rdb1/conv1/conv"
        ],
        "attr": {
          "alpha": {
            "f": 0.2
          }
        }
      },
      {
        "name": "rrdb_0/rdb1/concat1",
        "op": "ConcatV2",
        "input": [
          "conv_first/conv",
          "rrdb_0/rdb1/conv1/leaky_relu"
        ],
        "attr": {
          "N": {
            "i": 2
          },
          "T": {
            "type": "DT_FLOAT"
          },
          "Tidx": {
            "type": "DT_INT32"
          }
        }
      },
      {
        "name": "rrdb_0/rdb1/conv2/conv",
        "op": "Conv2D",
        "input": [
          "rrdb_0/rdb1/concat1"
        ],
        "attr": {
          "kernel_size": {
            "list": {
              "i": [
                3,
                3
              ]
            }
          },
          "filters": {
            "i": 32
          },
          "strides": {
            "list": {
              "i": [
                1,
                1
              ]
            }
          },
          "padding": {
            "s": "same"
          },
          "data_format": {
            "s": "NHWC"
          }
        }
      },
      {
        "name": "rrdb_0/rdb1/conv2/leaky_relu",
        "op": "LeakyRelu",
        "input": [
          "rrdb_0/rdb1/conv2/conv"
        ],
        "attr": {
          "alpha": {
            "f": 0.2
          }
        }
      },
      {
        "name": "rrdb_0/rdb1/concat2",
        "op": "ConcatV2",
        "input": [
          "conv_first/conv",
          "rrdb_0/rdb1/conv1/leaky_relu",
          "rrdb_0/rdb1/conv2/leaky_relu"
        ],
        "attr": {
          "N": {
            "i": 3
          },
          "T": {
            "type": "DT_FLOAT"
          },
          "Tidx": {
            "type": "DT_INT32"
          }
        }
      },
      {
        "name": "rrdb_0/rdb1/conv3/conv",
        "op": "Conv2D",
        "input": [
          "rrdb_0/rdb1/concat2"
        ],
        "attr": {
          "kernel_size": {
            "list": {
              "i": [
                3,
                3
              ]
            }
          },
          "filters": {
            "i": 32
          },
          "strides": {
            "list": {
              "i": [
                1,
                1
              ]
            }
          },
          "padding": {
            "s": "same"
          },
          "data_format": {
            "s": "NHWC"
          }
        }
      },
      {
        "name": "rrdb_0/rdb1/conv3/leaky_relu",
        "op": "LeakyRelu",
        "input": [
          "rrdb_0/rdb1/conv3/conv"
        ],
        "attr": {
          "alpha": {
            "f": 0.2
          }
        }
      },
      {
        "name": "rrdb_0/rdb1/concat3",
        "op": "ConcatV2",
        "input": [
          "conv_first/conv",
          "rrdb_0/rdb1/conv1/leaky_relu",
          "rrdb_0/rdb1/conv2/leaky_relu",
          "rrdb_0/rdb1/conv3/leaky_relu"
        ],
        "attr": {
          "N": {
            "i": 4
          },
          "T": {
            "type": "DT_FLOAT"
          },
          "Tidx": {
            "type": "DT_INT32"
          }
        }
      },
      {
        "name": "rrdb_0/rdb1/conv4/conv",
        "op": "Conv2D",
        "input": [
          "rrdb_0/rdb1/concat3"
        ],
        "attr": {
          "kernel_size": {
            "list": {
              "i": [
                3,
                3
              ]
            }
          },
          "filters": {
            "i": 32
          },
          "strides": {
            "list": {
              "i": [
                1,
                1
              ]
            }
          },
          "padding": {
            "s": "same"
          },
          "data_format": {
            "s": "NHWC"
          }
        }
      },
      {
        "name": "rrdb_0/rdb1/conv4/leaky_relu",
        "op": "LeakyRelu",
        "input": [
          "rrdb_0/rdb1/conv4/conv"
        ],
        "attr": {
          "alpha": {
            "f": 0.2
          }
        }
      },
      {
        "name": "rrdb_0/rdb1/concat4",
        "op": "ConcatV2",
        "input": [
          "conv_first/conv",
          "rrdb_0/rdb1/conv1/leaky_relu",
          "rrdb_0/rdb1/conv2/leaky_relu",
          "rrdb_0/rdb1/conv3/leaky_relu",
          "rrdb_0/rdb1/conv4/leaky_relu"
        ],
        "attr": {
          "N": {
            "i": 5
          },
          "T": {
            "type": "DT_FLOAT"
          },
          "Tidx": {
            "type": "DT_INT32"
          }
        }
      },
      {
        "name": "rrdb_0/rdb1/conv5/conv",
        "op": "Conv2D",
        "input": [
          "rrdb_0/rdb1/concat4"
        ],
        "attr": {
          "kernel_size": {
            "list": {
              "i": [
                3,
                3
              ]
            }
          },
          "filters": {
            "i": 64
          },
          "strides": {
            "list": {
              "i": [
                1,
                1
              ]
            }
          },
          "padding": {
            "s": "same"
          },
          "data_format": {
            "s": "NHWC"
          }
        }
      },
      {
        "name": "rrdb_0/rdb1/add",
        "op": "Add",
        "input": [
          "conv_first/conv",
          "rrdb_0/rdb1/conv5/conv"
        ]
      },
      {
        "name": "rrdb_1/rdb1/conv1/conv",
        "op": "Conv2D",
        "input": [
          "rrdb_0/rdb1/add"
        ],
        "attr": {
          "kernel_size": {
            "list": {
              "i": [
                3,
                3
              ]
            }
          },
          "filters": {
            "i": 32
          },
          "strides": {
            "list": {
              "i": [
                1,
                1
              ]
            }
          },
          "padding": {
            "s": "same"
          },
          "data_format": {
            "s": "NHWC"
          }
        }
      },
      {
        "name": "rrdb_1/rdb1/conv1/leaky_relu",
        "op": "LeakyRelu",
        "input": [
          "rrdb_1/rdb1/conv1/conv"
        ],
        "attr": {
          "alpha": {
            "f": 0.2
          }
        }
      },
      {
        "name": "rrdb_1/rdb1/concat1",
        "op": "ConcatV2",
        "input": [
          "rrdb_0/rdb1/add",
          "rrdb_1/rdb1/conv1/leaky_relu"
        ],
        "attr": {
          "N": {
            "i": 2
          },
          "T": {
            "type": "DT_FLOAT"
          },
          "Tidx": {
            "type": "DT_INT32"
          }
        }
      },
      {
        "name": "rrdb_1/rdb1/conv2/conv",
        "op": "Conv2D",
        "input": [
          "rrdb_1/rdb1/concat1"
        ],
        "attr": {
          "kernel_size": {
            "list": {
              "i": [
                3,
                3
              ]
            }
          },
          "filters": {
            "i": 32
          },
          "strides": {
            "list": {
              "i": [
                1,
                1
              ]
            }
          },
          "padding": {
            "s": "same"
          },
          "data_format": {
            "s": "NHWC"
          }
        }
      },
      {
        "name": "rrdb_1/rdb1/conv2/leaky_relu",
        "op": "LeakyRelu",
        "input": [
          "rrdb_1/rdb1/conv2/conv"
        ],
        "attr": {
          "alpha": {
            "f": 0.2
          }
        }
      },
      {
        "name": "rrdb_1/rdb1/concat2",
        "op": "ConcatV2",
        "input": [
          "rrdb_0/rdb1/add",
          "rrdb_1/rdb1/conv1/leaky_relu",
          "rrdb_1/rdb1/conv2/leaky_relu"
        ],
        "attr": {
          "N": {
            "i": 3
          },
          "T": {
            "type": "DT_FLOAT"
          },
          "Tidx": {
            "type": "DT_INT32"
          }
        }
      },
      {
        "name": "rrdb_1/rdb1/conv3/conv",
        "op": "Conv2D",
        "input": [
          "rrdb_1/rdb1/concat2"
        ],
        "attr": {
          "kernel_size": {
            "list": {
              "i": [
                3,
                3
              ]
            }
          },
          "filters": {
            "i": 32
          },
          "strides": {
            "list": {
              "i": [
                1,
                1
              ]
            }
          },
          "padding": {
            "s": "same"
          },
          "data_format": {
            "s": "NHWC"
          }
        }
      },
      {
        "name": "rrdb_1/rdb1/conv3/leaky_relu",
        "op": "LeakyRelu",
        "input": [
          "rrdb_1/rdb1/conv3/conv"
        ],
        "attr": {
          "alpha": {
            "f": 0.2
          }
        }
      },
      {
        "name": "rrdb_1/rdb1/concat3",
        "op": "ConcatV2",
        "input": [
          "rrdb_0/rdb1/add",
          "rrdb_1/rdb1/conv1/leaky_relu",
          "rrdb_1/rdb1/conv2/leaky_relu",
          "rrdb_1/rdb1/conv3/leaky_relu"
        ],
        "attr": {
          "N": {
            "i": 4
          },
          "T": {
            "type": "DT_FLOAT"
          },
          "Tidx": {
            "type": "DT_INT32"
          }
        }
      },
      {
        "name": "rrdb_1/rdb1/conv4/conv",
        "op": "Conv2D",
        "input": [
          "rrdb_1/rdb1/concat3"
        ],
        "attr": {
          "kernel_size": {
            "list": {
              "i": [
                3,
                3
              ]
            }
          },
          "filters": {
            "i": 32
          },
          "strides": {
            "list": {
              "i": [
                1,
                1
              ]
            }
          },
          "padding": {
            "s": "same"
          },
          "data_format": {
            "s": "NHWC"
          }
        }
      },
      {
        "name": "rrdb_1/rdb1/conv4/leaky_relu",
        "op": "LeakyRelu",
        "input": [
          "rrdb_1/rdb1/conv4/conv"
        ],
        "attr": {
          "alpha": {
            "f": 0.2
          }
        }
      },
      {
        "name": "rrdb_1/rdb1/concat4",
        "op": "ConcatV2",
        "input": [
          "rrdb_0/rdb1/add",
          "rrdb_1/rdb1/conv1/leaky_relu",
          "rrdb_1/rdb1/conv2/leaky_relu",
          "rrdb_1/rdb1/conv3/leaky_relu",
          "rrdb_1/rdb1/conv4/leaky_relu"
        ],
        "attr": {
          "N": {
            "i": 5
          },
          "T": {
            "type": "DT_FLOAT"
          },
          "Tidx": {
            "type": "DT_INT32"
          }
        }
      },
      {
        "name": "rrdb_1/rdb1/conv5/conv",
        "op": "Conv2D",
        "input": [
          "rrdb_1/rdb1/concat4"
        ],
        "attr": {
          "kernel_size": {
            "list": {
              "i": [
                3,
                3
              ]
            }
          },
          "filters": {
            "i": 64
          },
          "strides": {
            "list": {
              "i": [
                1,
                1
              ]
            }
          },
          "padding": {
            "s": "same"
          },
          "data_format": {
            "s": "NHWC"
          }
        }
      },
      {
        "name": "rrdb_1/rdb1/add",
        "op": "Add",
        "input": [
          "rrdb_0/rdb1/add",
          "rrdb_1/rdb1/conv5/conv"
        ]
      },
      {
        "name": "rrdb_2/rdb1/conv1/conv",
        "op": "Conv2D",
        "input": [
          "rrdb_1/rdb1/add"
        ],
        "attr": {
          "kernel_size": {
            "list": {
              "i": [
                3,
                3
              ]
            }
          },
          "filters": {
            "i": 32
          },
          "strides": {
            "list": {
              "i": [
                1,
                1
              ]
            }
          },
          "padding": {
            "s": "same"
          },
          "data_format": {
            "s": "NHWC"
          }
        }
      },
      {
        "name": "rrdb_2/rdb1/conv1/leaky_relu",
        "op": "LeakyRelu",
        "input": [
          "rrdb_2/rdb1/conv1/conv"
        ],
        "attr": {
          "alpha": {
            "f": 0.2
          }
        }
      },
      {
        "name": "rrdb_2/rdb1/concat1",
        "op": "ConcatV2",
        "input": [
          "rrdb_1/rdb1/add",
          "rrdb_2/rdb1/conv1/leaky_relu"
        ],
        "attr": {
          "N": {
            "i": 2
          },
          "T": {
            "type": "DT_FLOAT"
          },
          "Tidx": {
            "type": "DT_INT32"
          }
        }
      },
      {
        "name": "rrdb_2/rdb1/conv2/conv",
        "op": "Conv2D",
        "input": [
          "rrdb_2/rdb1/concat1"
        ],
        "attr": {
          "kernel_size": {
            "list": {
              "i": [
                3,
                3
              ]
            }
          },
          "filters": {
            "i": 32
          },
          "strides": {
            "list": {
              "i": [
                1,
                1
              ]
            }
          },
          "padding": {
            "s": "same"
          },
          "data_format": {
            "s": "NHWC"
          }
        }
      },
      {
        "name": "rrdb_2/rdb1/conv2/leaky_relu",
        "op": "LeakyRelu",
        "input": [
          "rrdb_2/rdb1/conv2/conv"
        ],
        "attr": {
          "alpha": {
            "f": 0.2
          }
        }
      },
      {
        "name": "rrdb_2/rdb1/concat2",
        "op": "ConcatV2",
        "input": [
          "rrdb_1/rdb1/add",
          "rrdb_2/rdb1/conv1/leaky_relu",
          "rrdb_2/rdb1/conv2/leaky_relu"
        ],
        "attr": {
          "N": {
            "i": 3
          },
          "T": {
            "type": "DT_FLOAT"
          },
          "Tidx": {
            "type": "DT_INT32"
          }
        }
      },
      {
        "name": "rrdb_2/rdb1/conv3/conv",
        "op": "Conv2D",
        "input": [
          "rrdb_2/rdb1/concat2"
        ],
        "attr": {
          "kernel_size": {
            "list": {
              "i": [
                3,
                3
              ]
            }
          },
          "filters": {
            "i": 32
          },
          "strides": {
            "list": {
              "i": [
                1,
                1
              ]
            }
          },
          "padding": {
            "s": "same"
          },
          "data_format": {
            "s": "NHWC"
          }
        }
      },
      {
        "name": "rrdb_2/rdb1/conv3/leaky_relu",
        "op": "LeakyRelu",
        "input": [
          "rrdb_2/rdb1/conv3/conv"
        ],
        "attr": {
          "alpha": {
            "f": 0.2
          }
        }
      },
      {
        "name": "rrdb_2/rdb1/concat3",
        "op": "ConcatV2",
        "input": [
          "rrdb_1/rdb1/add",
          "rrdb_2/rdb1/conv1/leaky_relu",
          "rrdb_2/rdb1/conv2/leaky_relu",
          "rrdb_2/rdb1/conv3/leaky_relu"
        ],
        "attr": {
          "N": {
            "i": 4
          },
          "T": {
            "type": "DT_FLOAT"
          },
          "Tidx": {
            "type": "DT_INT32"
          }
        }
      },
      {
        "name": "rrdb_2/rdb1/conv4/conv",
        "op": "Conv2D",
        "input": [
          "rrdb_2/rdb1/concat3"
        ],
        "attr": {
          "kernel_size": {
            "list": {
              "i": [
                3,
                3
              ]
            }
          },
          "filters": {
            "i": 32
          },
          "strides": {
            "list": {
              "i": [
                1,
                1
              ]
            }
          },
          "padding": {
            "s": "same"
          },
          "data_format": {
            "s": "NHWC"
          }
        }
      },
      {
        "name": "rrdb_2/rdb1/conv4/leaky_relu",
        "op": "LeakyRelu",
        "input": [
          "rrdb_2/rdb1/conv4/conv"
        ],
        "attr": {
          "alpha": {
            "f": 0.2
          }
        }
      },
      {
        "name": "rrdb_2/rdb1/concat4",
        "op": "ConcatV2",
        "input": [
          "rrdb_1/rdb1/add",
          "rrdb_2/rdb1/conv1/leaky_relu",
          "rrdb_2/rdb1/conv2/leaky_relu",
          "rrdb_2/rdb1/conv3/leaky_relu",
          "rrdb_2/rdb1/conv4/leaky_relu"
        ],
        "attr": {
          "N": {
            "i": 5
          },
          "T": {
            "type": "DT_FLOAT"
          },
          "Tidx": {
            "type": "DT_INT32"
          }
        }
      },
      {
        "name": "rrdb_2/rdb1/conv5/conv",
        "op": "Conv2D",
        "input": [
          "rrdb_2/rdb1/concat4"
        ],
        "attr": {
          "kernel_size": {
            "list": {
              "i": [
                3,
                3
              ]
            }
          },
          "filters": {
            "i": 64
          },
          "strides": {
            "list": {
              "i": [
                1,
                1
              ]
            }
          },
          "padding": {
            "s": "same"
          },
          "data_format": {
            "s": "NHWC"
          }
        }
      },
      {
        "name": "rrdb_2/rdb1/add",
        "op": "Add",
        "input": [
          "rrdb_1/rdb1/add",
          "rrdb_2/rdb1/conv5/conv"
        ]
      },
      {
        "name": "rrdb_3/rdb1/conv1/conv",
        "op": "Conv2D",
        "input": [
          "rrdb_2/rdb1/add"
        ],
        "attr": {
          "kernel_size": {
            "list": {
              "i": [
                3,
                3
              ]
            }
          },
          "filters": {
            "i": 32
          },
          "strides": {
            "list": {
              "i": [
                1,
                1
              ]
            }
          },
          "padding": {
            "s": "same"
          },
          "data_format": {
            "s": "NHWC"
          }
        }
      },
      {
        "name": "rrdb_3/rdb1/conv1/leaky_relu",
        "op": "LeakyRelu",
        "input": [
          "rrdb_3/rdb1/conv1/conv"
        ],
        "attr": {
          "alpha": {
            "f": 0.2
          }
        }
      },
      {
        "name": "rrdb_3/rdb1/concat1",
        "op": "ConcatV2",
        "input": [
          "rrdb_2/rdb1/add",
          "rrdb_3/rdb1/conv1/leaky_relu"
        ],
        "attr": {
          "N": {
            "i": 2
          },
          "T": {
            "type": "DT_FLOAT"
          },
          "Tidx": {
            "type": "DT_INT32"
          }
        }
      },
      {
        "name": "rrdb_3/rdb1/conv2/conv",
        "op": "Conv2D",
        "input": [
          "rrdb_3/rdb1/concat1"
        ],
        "attr": {
          "kernel_size": {
            "list": {
              "i": [
                3,
                3
              ]
            }
          },
          "filters": {
            "i": 32
          },
          "strides": {
            "list": {
              "i": [
                1,
                1
              ]
            }
          },
          "padding": {
            "s": "same"
          },
          "data_format": {
            "s": "NHWC"
          }
        }
      },
      {
        "name": "rrdb_3/rdb1/conv2/leaky_relu",
        "op": "LeakyRelu",
        "input": [
          "rrdb_3/rdb1/conv2/conv"
        ],
        "attr": {
          "alpha": {
            "f": 0.2
          }
        }
      },
      {
        "name": "rrdb_3/rdb1/concat2",
        "op": "ConcatV2",
        "input": [
          "rrdb_2/rdb1/add",
          "rrdb_3/rdb1/conv1/leaky_relu",
          "rrdb_3/rdb1/conv2/leaky_relu"
        ],
        "attr": {
          "N": {
            "i": 3
          },
          "T": {
            "type": "DT_FLOAT"
          },
          "Tidx": {
            "type": "DT_INT32"
          }
        }
      },
      {
        "name": "rrdb_3/rdb1/conv3/conv",
        "op": "Conv2D",
        "input": [
          "rrdb_3/rdb1/concat2"
        ],
        "attr": {
          "kernel_size": {
            "list": {
              "i": [
                3,
                3
              ]
            }
          },
          "filters": {
            "i": 32
          },
          "strides": {
            "list": {
              "i": [
                1,
                1
              ]
            }
          },
          "padding": {
            "s": "same"
          },
          "data_format": {
            "s": "NHWC"
          }
        }
      },
      {
        "name": "rrdb_3/rdb1/conv3/leaky_relu",
        "op": "LeakyRelu",
        "input": [
          "rrdb_3/rdb1/conv3/conv"
        ],
        "attr": {
          "alpha": {
            "f": 0.2
          }
        }
      },
      {
        "name": "rrdb_3/rdb1/concat3",
        "op": "ConcatV2",
        "input": [
          "rrdb_2/rdb1/add",
          "rrdb_3/rdb1/conv1/leaky_relu",
          "rrdb_3/rdb1/conv2/leaky_relu",
          "rrdb_3/rdb1/conv3/leaky_relu"
        ],
        "attr": {
          "N": {
            "i": 4
          },
          "T": {
            "type": "DT_FLOAT"
          },
          "Tidx": {
            "type": "DT_INT32"
          }
        }
      },
      {
        "name": "rrdb_3/rdb1/conv4/conv",
        "op": "Conv2D",
        "input": [
          "rrdb_3/rdb1/concat3"
        ],
        "attr": {
          "kernel_size": {
            "list": {
              "i": [
                3,
                3
              ]
            }
          },
          "filters": {
            "i": 32
          },
          "strides": {
            "list": {
              "i": [
                1,
                1
              ]
            }
          },
          "padding": {
            "s": "same"
          },
          "data_format": {
            "s": "NHWC"
          }
        }
      },
      {
        "name": "rrdb_3/rdb1/conv4/leaky_relu",
        "op": "LeakyRelu",
        "input": [
          "rrdb_3/rdb1/conv4/conv"
        ],
        "attr": {
          "alpha": {
            "f": 0.2
          }
        }
      },
      {
        "name": "rrdb_3/rdb1/concat4",
        "op": "ConcatV2",
        "input": [
          "rrdb_2/rdb1/add",
          "rrdb_3/rdb1/conv1/leaky_relu",
          "rrdb_3/rdb1/conv2/leaky_relu",
          "rrdb_3/rdb1/conv3/leaky_relu",
          "rrdb_3/rdb1/conv4/leaky_relu"
        ],
        "attr": {
          "N": {
            "i": 5
          },
          "T": {
            "type": "DT_FLOAT"
          },
          "Tidx": {
            "type": "DT_INT32"
          }
        }
      },
      {
        "name": "rrdb_3/rdb1/conv5/conv",
        "op": "Conv2D",
        "input": [
          "rrdb_3/rdb1/concat4"
        ],
        "attr": {
          "kernel_size": {
            "list": {
              "i": [
                3,
                3
              ]
            }
          },
          "filters": {
            "i": 64
          },
          "strides": {
            "list": {
              "i": [
                1,
                1
              ]
            }
          },
          "padding": {
            "s": "same"
          },
          "data_format": {
            "s": "NHWC"
          }
        }
      },
      {
        "name": "rrdb_3/rdb1/add",
        "op": "Add",
        "input": [
          "rrdb_2/rdb1/add",
          "rrdb_3/rdb1/conv5/conv"
        ]
      },
      {
        "name": "rrdb_4/rdb1/conv1/conv",
        "op": "Conv2D",
        "input": [
          "rrdb_3/rdb1/add"
        ],
        "attr": {
          "kernel_size": {
            "list": {
              "i": [
                3,
                3
              ]
            }
          },
          "filters": {
            "i": 32
          },
          "strides": {
            "list": {
              "i": [
                1,
                1
              ]
            }
          },
          "padding": {
            "s": "same"
          },
          "data_format": {
            "s": "NHWC"
          }
        }
      },
      {
        "name": "rrdb_4/rdb1/conv1/leaky_relu",
        "op": "LeakyRelu",
        "input": [
          "rrdb_4/rdb1/conv1/conv"
        ],
        "attr": {
          "alpha": {
            "f": 0.2
          }
        }
      },
      {
        "name": "rrdb_4/rdb1/concat1",
        "op": "ConcatV2",
        "input": [
          "rrdb_3/rdb1/add",
          "rrdb_4/rdb1/conv1/leaky_relu"
        ],
        "attr": {
          "N": {
            "i": 2
          },
          "T": {
            "type": "DT_FLOAT"
          },
          "Tidx": {
            "type": "DT_INT32"
          }
        }
      },
      {
        "name": "rrdb_4/rdb1/conv2/conv",
        "op": "Conv2D",
        "input": [
          "rrdb_4/rdb1/concat1"
        ],
        "attr": {
          "kernel_size": {
            "list": {
              "i": [
                3,
                3
              ]
            }
          },
          "filters": {
            "i": 32
          },
          "strides": {
            "list": {
              "i": [
                1,
                1
              ]
            }
          },
          "padding": {
            "s": "same"
          },
          "data_format": {
            "s": "NHWC"
          }
        }
      },
      {
        "name": "rrdb_4/rdb1/conv2/leaky_relu",
        "op": "LeakyRelu",
        "input": [
          "rrdb_4/rdb1/conv2/conv"
        ],
        "attr": {
          "alpha": {
            "f": 0.2
          }
        }
      },
      {
        "name": "rrdb_4/rdb1/concat2",
        "op": "ConcatV2",
        "input": [
          "rrdb_3/rdb1/add",
          "rrdb_4/rdb1/conv1/leaky_relu",
          "rrdb_4/rdb1/conv2/leaky_relu"
        ],
        "attr": {
          "N": {
            "i": 3
          },
          "T": {
            "type": "DT_FLOAT"
          },
          "Tidx": {
            "type": "DT_INT32"
          }
        }
      },
      {
        "name": "rrdb_4/rdb1/conv3/conv",
        "op": "Conv2D",
        "input": [
          "rrdb_4/rdb1/concat2"
        ],
        "attr": {
          "kernel_size": {
            "list": {
              "i": [
                3,
                3
              ]
            }
          },
          "filters": {
            "i": 32
          },
          "strides": {
            "list": {
              "i": [
                1,
                1
              ]
            }
          },
          "padding": {
            "s": "same"
          },
          "data_format": {
            "s": "NHWC"
          }
        }
      },
      {
        "name": "rrdb_4/rdb1/conv3/leaky_relu",
        "op": "LeakyRelu",
        "input": [
          "rrdb_4/rdb1/conv3/conv"
        ],
        "attr": {
          "alpha": {
            "f": 0.2
          }
        }
      },
      {
        "name": "rrdb_4/rdb1/concat3",
        "op": "ConcatV2",
        "input": [
          "rrdb_3/rdb1/add",
          "rrdb_4/rdb1/conv1/leaky_relu",
          "rrdb_4/rdb1/conv2/leaky_relu",
          "rrdb_4/rdb1/conv3/leaky_relu"
        ],
        "attr": {
          "N": {
            "i": 4
          },
          "T": {
            "type": "DT_FLOAT"
          },
          "Tidx": {
            "type": "DT_INT32"
          }
        }
      },
      {
        "name": "rrdb_4/rdb1/conv4/conv",
        "op": "Conv2D",
        "input": [
          "rrdb_4/rdb1/concat3"
        ],
        "attr": {
          "kernel_size": {
            "list": {
              "i": [
                3,
                3
              ]
            }
          },
          "filters": {
            "i": 32
          },
          "strides": {
            "list": {
              "i": [
                1,
                1
              ]
            }
          },
          "padding": {
            "s": "same"
          },
          "data_format": {
            "s": "NHWC"
          }
        }
      },
      {
        "name": "rrdb_4/rdb1/conv4/leaky_relu",
        "op": "LeakyRelu",
        "input": [
          "rrdb_4/rdb1/conv4/conv"
        ],
        "attr": {
          "alpha": {
            "f": 0.2
          }
        }
      },
      {
        "name": "rrdb_4/rdb1/concat4",
        "op": "ConcatV2",
        "input": [
          "rrdb_3/rdb1/add",
          "rrdb_4/rdb1/conv1/leaky_relu",
          "rrdb_4/rdb1/conv2/leaky_relu",
          "rrdb_4/rdb1/conv3/leaky_relu",
          "rrdb_4/rdb1/conv4/leaky_relu"
        ],
        "attr": {
          "N": {
            "i": 5
          },
          "T": {
            "type": "DT_FLOAT"
          },
          "Tidx": {
            "type": "DT_INT32"
          }
        }
      },
      {
        "name": "rrdb_4/rdb1/conv5/conv",
        "op": "Conv2D",
        "input": [
          "rrdb_4/rdb1/concat4"
        ],
        "attr": {
          "kernel_size": {
            "list": {
              "i": [
                3,
                3
              ]
            }
          },
          "filters": {
            "i": 64
          },
          "strides": {
            "list": {
              "i": [
                1,
                1
              ]
            }
          },
          "padding": {
            "s": "same"
          },
          "data_format": {
            "s": "NHWC"
          }
        }
      },
      {
        "name": "rrdb_4/rdb1/add",
        "op": "Add",
        "input": [
          "rrdb_3/rdb1/add",
          "rrdb_4/rdb1/conv5/conv"
        ]
      },
      {
        "name": "rrdb_5/rdb1/conv1/conv",
        "op": "Conv2D",
        "input": [
          "rrdb_4/rdb1/add"
        ],
        "attr": {
          "kernel_size": {
            "list": {
              "i": [
                3,
                3
              ]
            }
          },
          "filters": {
            "i": 32
          },
          "strides": {
            "list": {
              "i": [
                1,
                1
              ]
            }
          },
          "padding": {
            "s": "same"
          },
          "data_format": {
            "s": "NHWC"
          }
        }
      },
      {
        "name": "rrdb_5/rdb1/conv1/leaky_relu",
        "op": "LeakyRelu",
        "input": [
          "rrdb_5/rdb1/conv1/conv"
        ],
        "attr": {
          "alpha": {
            "f": 0.2
          }
        }
      },
      {
        "name": "rrdb_5/rdb1/concat1",
        "op": "ConcatV2",
        "input": [
          "rrdb_4/rdb1/add",
          "rrdb_5/rdb1/conv1/leaky_relu"
        ],
        "attr": {
          "N": {
            "i": 2
          },
          "T": {
            "type": "DT_FLOAT"
          },
          "Tidx": {
            "type": "DT_INT32"
          }
        }
      },
      {
        "name": "rrdb_5/rdb1/conv2/conv",
        "op": "Conv2D",
        "input": [
          "rrdb_5/rdb1/concat1"
        ],
        "attr": {
          "kernel_size": {
            "list": {
              "i": [
                3,
                3
              ]
            }
          },
          "filters": {
            "i": 32
          },
          "strides": {
            "list": {
              "i": [
                1,
                1
              ]
            }
          },
          "padding": {
            "s": "same"
          },
          "data_format": {
            "s": "NHWC"
          }
        }
      },
      {
        "name": "rrdb_5/rdb1/conv2/leaky_relu",
        "op": "LeakyRelu",
        "input": [
          "rrdb_5/rdb1/conv2/conv"
        ],
        "attr": {
          "alpha": {
            "f": 0.2
          }
        }
      },
      {
        "name": "rrdb_5/rdb1/concat2",
        "op": "ConcatV2",
        "input": [
          "rrdb_4/rdb1/add",
          "rrdb_5/rdb1/conv1/leaky_relu",
          "rrdb_5/rdb1/conv2/leaky_relu"
        ],
        "attr": {
          "N": {
            "i": 3
          },
          "T": {
            "type": "DT_FLOAT"
          },
          "Tidx": {
            "type": "DT_INT32"
          }
        }
      },
      {
        "name": "rrdb_5/rdb1/conv3/conv",
        "op": "Conv2D",
        "input": [
          "rrdb_5/rdb1/concat2"
        ],
        "attr": {
          "kernel_size": {
            "list": {
              "i": [
                3,
                3
              ]
            }
          },
          "filters": {
            "i": 32
          },
          "strides": {
            "list": {
              "i": [
                1,
                1
              ]
            }
          },
          "padding": {
            "s": "same"
          },
          "data_format": {
            "s": "NHWC"
          }
        }
      },
      {
        "name": "rrdb_5/rdb1/conv3/leaky_relu",
        "op": "LeakyRelu",
        "input": [
          "rrdb_5/rdb1/conv3/conv"
        ],
        "attr": {
          "alpha": {
            "f": 0.2
          }
        }
      },
      {
        "name": "rrdb_5/rdb1/concat3",
        "op": "ConcatV2",
        "input": [
          "rrdb_4/rdb1/add",
          "rrdb_5/rdb1/conv1/leaky_relu",
          "rrdb_5/rdb1/conv2/leaky_relu",
          "rrdb_5/rdb1/conv3/leaky_relu"
        ],
        "attr": {
          "N": {
            "i": 4
          },
          "T": {
            "type": "DT_FLOAT"
          },
          "Tidx": {
            "type": "DT_INT32"
          }
        }
      },
      {
        "name": "rrdb_5/rdb1/conv4/conv",
        "op": "Conv2D",
        "input": [
          "rrdb_5/rdb1/concat3"
        ],
        "attr": {
          "kernel_size": {
            "list": {
              "i": [
                3,
                3
              ]
            }
          },
          "filters": {
            "i": 32
          },
          "strides": {
            "list": {
              "i": [
                1,
                1
              ]
            }
          },
          "padding": {
            "s": "same"
          },
          "data_format": {
            "s": "NHWC"
          }
        }
      },
      {
        "name": "rrdb_5/rdb1/conv4/leaky_relu",
        "op": "LeakyRelu",
        "input": [
          "rrdb_5/rdb1/conv4/conv"
        ],
        "attr": {
          "alpha": {
            "f": 0.2
          }
        }
      },
      {
        "name": "rrdb_5/rdb1/concat4",
        "op": "ConcatV2",
        "input": [
          "rrdb_4/rdb1/add",
          "rrdb_5/rdb1/conv1/leaky_relu",
          "rrdb_5/rdb1/conv2/leaky_relu",
          "rrdb_5/rdb1/conv3/leaky_relu",
          "rrdb_5/rdb1/conv4/leaky_relu"
        ],
        "attr": {
          "N": {
            "i": 5
          },
          "T": {
            "type": "DT_FLOAT"
          },
          "Tidx": {
            "type": "DT_INT32"
          }
        }
      },
      {
        "name": "rrdb_5/rdb1/conv5/conv",
        "op": "Conv2D",
        "input": [
          "rrdb_5/rdb1/concat4"
        ],
        "attr": {
          "kernel_size": {
            "list": {
              "i": [
                3,
                3
              ]
            }
          },
          "filters": {
            "i": 64
          },
          "strides": {
            "list": {
              "i": [
                1,
                1
              ]
            }
          },
          "padding": {
            "s": "same"
          },
          "data_format": {
            "s": "NHWC"
          }
        }
      },
      {
        "name": "rrdb_5/rdb1/add",
        "op": "Add",
        "input": [
          "rrdb_4/rdb1/add",
          "rrdb_5/rdb1/conv5/conv"
        ]
      },
      {
        "name": "rrdb_6/rdb1/conv1/conv",
        "op": "Conv2D",
        "input": [
          "rrdb_5/rdb1/add"
        ],
        "attr": {
          "kernel_size": {
            "list": {
              "i": [
                3,
                3
              ]
            }
          },
          "filters": {
            "i": 32
          },
          "strides": {
            "list": {
              "i": [
                1,
                1
              ]
            }
          },
          "padding": {
            "s": "same"
          },
          "data_format": {
            "s": "NHWC"
          }
        }
      },
      {
        "name": "rrdb_6/rdb1/conv1/leaky_relu",
        "op": "LeakyRelu",
        "input": [
          "rrdb_6/rdb1/conv1/conv"
        ],
        "attr": {
          "alpha": {
            "f": 0.2
          }
        }
      },
      {
        "name": "rrdb_6/rdb1/concat1",
        "op": "ConcatV2",
        "input": [
          "rrdb_5/rdb1/add",
          "rrdb_6/rdb1/conv1/leaky_relu"
        ],
        "attr": {
          "N": {
            "i": 2
          },
          "T": {
            "type": "DT_FLOAT"
          },
          "Tidx": {
            "type": "DT_INT32"
          }
        }
      },
      {
        "name": "rrdb_6/rdb1/conv2/conv",
        "op": "Conv2D",
        "input": [
          "rrdb_6/rdb1/concat1"
        ],
        "attr": {
          "kernel_size": {
            "list": {
              "i": [
                3,
                3
              ]
            }
          },
          "filters": {
            "i": 32
          },
          "strides": {
            "list": {
              "i": [
                1,
                1
              ]
            }
          },
          "padding": {
            "s": "same"
          },
          "data_format": {
            "s": "NHWC"
          }
        }
      },
      {
        "name": "rrdb_6/rdb1/conv2/leaky_relu",
        "op": "LeakyRelu",
        "input": [
          "rrdb_6/rdb1/conv2/conv"
        ],
        "attr": {
          "alpha": {
            "f": 0.2
          }
        }
      },
      {
        "name": "rrdb_6/rdb1/concat2",
        "op": "ConcatV2",
        "input": [
          "rrdb_5/rdb1/add",
          "rrdb_6/rdb1/conv1/leaky_relu",
          "rrdb_6/rdb1/conv2/leaky_relu"
        ],
        "attr": {
          "N": {
            "i": 3
          },
          "T": {
            "type": "DT_FLOAT"
          },
          "Tidx": {
            "type": "DT_INT32"
          }
        }
      },
      {
        "name": "rrdb_6/rdb1/conv3/conv",
        "op": "Conv2D",
        "input": [
          "rrdb_6/rdb1/concat2"
        ],
        "attr": {
          "kernel_size": {
            "list": {
              "i": [
                3,
                3
              ]
            }
          },
          "filters": {
            "i": 32
          },
          "strides": {
            "list": {
              "i": [
                1,
                1
              ]
            }
          },
          "padding": {
            "s": "same"
          },
          "data_format": {
            "s": "NHWC"
          }
        }
      },
      {
        "name": "rrdb_6/rdb1/conv3/leaky_relu",
        "op": "LeakyRelu",
        "input": [
          "rrdb_6/rdb1/conv3/conv"
        ],
        "attr": {
          "alpha": {
            "f": 0.2
          }
        }
      },
      {
        "name": "rrdb_6/rdb1/concat3",
        "op": "ConcatV2",
        "input": [
          "rrdb_5/rdb1/add",
          "rrdb_6/rdb1/conv1/leaky_relu",
          "rrdb_6/rdb1/conv2/leaky_relu",
          "rrdb_6/rdb1/conv3/leaky_relu"
        ],
        "attr": {
          "N": {
            "i": 4
          },
          "T": {
            "type": "DT_FLOAT"
          },
          "Tidx": {
            "type": "DT_INT32"
          }
        }
      },
      {
        "name": "rrdb_6/rdb1/conv4/conv",
        "op": "Conv2D",
        "input": [
          "rrdb_6/rdb1/concat3"
        ],
        "attr": {
          "kernel_size": {
            "list": {
              "i": [
                3,
                3
              ]
            }
          },
          "filters": {
            "i": 32
          },
          "strides": {
            "list": {
              "i": [
                1,
                1
              ]
            }
          },
          "padding": {
            "s": "same"
          },
          "data_format": {
            "s": "NHWC"
          }
        }
      },
      {
        "name": "rrdb_6/rdb1/conv4/leaky_relu",
        "op": "LeakyRelu",
        "input": [
          "rrdb_6/rdb1/conv4/conv"
        ],
        "attr": {
          "alpha": {
            "f": 0.2
          }
        }
      },
      {
        "name": "rrdb_6/rdb1/concat4",
        "op": "ConcatV2",
        "input": [
          "rrdb_5/rdb1/add",
          "rrdb_6/rdb1/conv1/leaky_relu",
          "rrdb_6/rdb1/conv2/leaky_relu",
          "rrdb_6/rdb1/conv3/leaky_relu",
          "rrdb_6/rdb1/conv4/leaky_relu"
        ],
        "attr": {
          "N": {
            "i": 5
          },
          "T": {
            "type": "DT_FLOAT"
          },
          "Tidx": {
            "type": "DT_INT32"
          }
        }
      },
      {
        "name": "rrdb_6/rdb1/conv5/conv",
        "op": "Conv2D",
        "input": [
          "rrdb_6/rdb1/concat4"
        ],
        "attr": {
          "kernel_size": {
            "list": {
              "i": [
                3,
                3
              ]
            }
          },
          "filters": {
            "i": 64
          },
          "strides": {
            "list": {
              "i": [
                1,
                1
              ]
            }
          },
          "padding": {
            "s": "same"
          },
          "data_format": {
            "s": "NHWC"
          }
        }
      },
      {
        "name": "rrdb_6/rdb1/add",
        "op": "Add",
        "input": [
          "rrdb_5/rdb1/add",
          "rrdb_6/rdb1/conv5/conv"
        ]
      },
      {
        "name": "rrdb_7/rdb1/conv1/conv",
        "op": "Conv2D",
        "input": [
          "rrdb_6/rdb1/add"
        ],
        "attr": {
          "kernel_size": {
            "list": {
              "i": [
                3,
                3
              ]
            }
          },
          "filters": {
            "i": 32
          },
          "strides": {
            "list": {
              "i": [
                1,
                1
              ]
            }
          },
          "padding": {
            "s": "same"
          },
          "data_format": {
            "s": "NHWC"
          }
        }
      },
      {
        "name": "rrdb_7/rdb1/conv1/leaky_relu",
        "op": "LeakyRelu",
        "input": [
          "rrdb_7/rdb1/conv1/conv"
        ],
        "attr": {
          "alpha": {
            "f": 0.2
          }
        }
      },
      {
        "name": "rrdb_7/rdb1/concat1",
        "op": "ConcatV2",
        "input": [
          "rrdb_6/rdb1/add",
          "rrdb_7/rdb1/conv1/leaky_relu"
        ],
        "attr": {
          "N": {
            "i": 2
          },
          "T": {
            "type": "DT_FLOAT"
          },
          "Tidx": {
            "type": "DT_INT32"
          }
        }
      },
      {
        "name": "rrdb_7/rdb1/conv2/conv",
        "op": "Conv2D",
        "input": [
          "rrdb_7/rdb1/concat1"
        ],
        "attr": {
          "kernel_size": {
            "list": {
              "i": [
                3,
                3
              ]
            }
          },
          "filters": {
            "i": 32
          },
          "strides": {
            "list": {
              "i": [
                1,
                1
              ]
            }
          },
          "padding": {
            "s": "same"
          },
          "data_format": {
            "s": "NHWC"
          }
        }
      },
      {
        "name": "rrdb_7/rdb1/conv2/leaky_relu",
        "op": "LeakyRelu",
        "input": [
          "rrdb_7/rdb1/conv2/conv"
        ],
        "attr": {
          "alpha": {
            "f": 0.2
          }
        }
      },
      {
        "name": "rrdb_7/rdb1/concat2",
        "op": "ConcatV2",
        "input": [
          "rrdb_6/rdb1/add",
          "rrdb_7/rdb1/conv1/leaky_relu",
          "rrdb_7/rdb1/conv2/leaky_relu"
        ],
        "attr": {
          "N": {
            "i": 3
          },
          "T": {
            "type": "DT_FLOAT"
          },
          "Tidx": {
            "type": "DT_INT32"
          }
        }
      },
      {
        "name": "rrdb_7/rdb1/conv3/conv",
        "op": "Conv2D",
        "input": [
          "rrdb_7/rdb1/concat2"
        ],
        "attr": {
          "kernel_size": {
            "list": {
              "i": [
                3,
                3
              ]
            }
          },
          "filters": {
            "i": 32
          },
          "strides": {
            "list": {
              "i": [
                1,
                1
              ]
            }
          },
          "padding": {
            "s": "same"
          },
          "data_format": {
            "s": "NHWC"
          }
        }
      },
      {
        "name": "rrdb_7/rdb1/conv3/leaky_relu",
        "op": "LeakyRelu",
        "input": [
          "rrdb_7/rdb1/conv3/conv"
        ],
        "attr": {
          "alpha": {
            "f": 0.2
          }
        }
      },
      {
        "name": "rrdb_7/rdb1/concat3",
        "op": "ConcatV2",
        "input": [
          "rrdb_6/rdb1/add",
          "rrdb_7/rdb1/conv1/leaky_relu",
          "rrdb_7/rdb1/conv2/leaky_relu",
          "rrdb_7/rdb1/conv3/leaky_relu"
        ],
        "attr": {
          "N": {
            "i": 4
          },
          "T": {
            "type": "DT_FLOAT"
          },
          "Tidx": {
            "type": "DT_INT32"
          }
        }
      },
      {
        "name": "rrdb_7/rdb1/conv4/conv",
        "op": "Conv2D",
        "input": [
          "rrdb_7/rdb1/concat3"
        ],
        "attr": {
          "kernel_size": {
            "list": {
              "i": [
                3,
                3
              ]
            }
          },
          "filters": {
            "i": 32
          },
          "strides": {
            "list": {
              "i": [
                1,
                1
              ]
            }
          },
          "padding": {
            "s": "same"
          },
          "data_format": {
            "s": "NHWC"
          }
        }
      },
      {
        "name": "rrdb_7/rdb1/conv4/leaky_relu",
        "op": "LeakyRelu",
        "input": [
          "rrdb_7/rdb1/conv4/conv"
        ],
        "attr": {
          "alpha": {
            "f": 0.2
          }
        }
      },
      {
        "name": "rrdb_7/rdb1/concat4",
        "op": "ConcatV2",
        "input": [
          "rrdb_6/rdb1/add",
          "rrdb_7/rdb1/conv1/leaky_relu",
          "rrdb_7/rdb1/conv2/leaky_relu",
          "rrdb_7/rdb1/conv3/leaky_relu",
          "rrdb_7/rdb1/conv4/leaky_relu"
        ],
        "attr": {
          "N": {
            "i": 5
          },
          "T": {
            "type": "DT_FLOAT"
          },
          "Tidx": {
            "type": "DT_INT32"
          }
        }
      },
      {
        "name": "rrdb_7/rdb1/conv5/conv",
        "op": "Conv2D",
        "input": [
          "rrdb_7/rdb1/concat4"
        ],
        "attr": {
          "kernel_size": {
            "list": {
              "i": [
                3,
                3
              ]
            }
          },
          "filters": {
            "i": 64
          },
          "strides": {
